/*1.（质因数分解）给出正整数 n，请输出将 n 质因数分解的结果，结果从小到大输出。 
    例如：输入 n=120，程序应该输出2 2 2 3 5，表示：120 = 2 × 2 × 2 × 3 × 5。输入保证 2≤n≤109。
    提示：先从小到大枚举变量 i，然后用 i 不停试除 n来寻找所有的质因子。
    试补全程序。
*/
#include <cstdio>
using namespace std;
int n, i;

int main() {
    scanf("%d", &n);
    for(i = /*1->*/2/*<-1*/; /*2->*/i * i/*<-2*/ <= n; i++) {
        /*3->*/while(n % i == 0)/*<-3*/ {
            printf("%d ", i);
            n = n / i;
        }
    }
    if(/*4->*/n > 1/*<-4*/)
        printf("%d ", /*5->*/n/*<-5*/);
    return 0;
}
/*
参考答案:
2
i * i
while(n % i == 0)
n > 1
n
*/